# Валидные данные для авторизации
valid_email = 'test_1.186@mail.ru'
valid_password = '12345'
# ------------------------------------------------------------------------------------------------

# Не валидные данные для авторизации
invalid_email = 'test_1.1886@mail.ru'
invalid_password = '1223345'
invalid_auth_key = {
  "key": "ce739848a1f15828e1c4579350e733e877b0ea729"
}
rotten_auth_key = {
  "key": "ea738148a1f19838e1c5d1413877f3691a3731380e733e877b0ae72"
}
# -----------------------------------------------------------------------------------------------


# Данные для добавления питомца
add_name = 'Рыжий'
add_age = '2'
add_animal_type = 'Кот'
add_pet_photo = 'images/1.jpeg'
# -----------------------------------------------------------------------------------------------

# Данные для обновления информации о питомце
update_name = 'Барсик'
update_age = '4'
update_animal_type = 'Сибирская кошка'
update_pet_photo = 'images/2.jpeg'
# ----------------------------------------------------------------------------------------------









